<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.intune.FirefoxSigned</string>
	<key>Input</key>
	<dict>
		<key>LATEST_RELEASE</key>
		<string>LATEST_FIREFOX_VERSION</string>
		<key>LOCALE</key>
<<<<<<< HEAD
		<string>en-US</string>
=======
		<string>de-DE</string>
>>>>>>> bc33355db96b2a946a089cee49cc5623235a9abf
		<key>NAME</key>
		<string>Firefox</string>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>Mozilla Firefox is a free and open source web browser.</string>
		<key>developer</key>
		<string>Mozilla</string>
		<key>display_name</key>
		<string>Firefox</string>
		<key>blacklist_versions</key>
		<array>
			<string>123.*</string>
		</array>
		<key>promotion_info</key>
		<array>
			<dict>
				<key>ring</key>
				<string>testing</string>
				<key>group_id</key>
				<string>{GROUP_ID}</string>
				<key>intent</key>
				<string>required</string>
				<key>days</key>
				<integer>1</integer>
			</dict>
			<dict>
				<key>ring</key>
				<string>beta</string>
				<key>group_id</key>
				<string>{GROUP_ID}</string>
				<key>intent</key>
				<string>required</string>
				<key>days</key>
				<integer>3</integer>
			</dict>
			<dict>
				<key>ring</key>
				<string>pre-prod</string>
				<key>group_id</key>
				<string>{GROUP_ID}</string>
				<key>intent</key>
				<string>required</string>
				<key>days</key>
				<integer>4</integer>
			</dict>
			<dict>
				<key>ring</key>
				<string>production</string>
				<key>group_id</key>
				<string>{GROUP_ID}</string>
				<key>intent</key>
				<string>required</string>
			</dict>
		</array>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.almenscorner.intune.FirefoxSigned</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</key>
			<dict>
				<key>git_hash</key>
				<string>d4b10043288978db1f1168ac3b6c841076c4558b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/IntuneUploader/IntuneAppIconGetter.py</string>
				<key>sha256_hash</key>
				<string>e3060bf0e15bd9ad9c5877805c0dcbb7b3732e1891b654ece10c4f35987c7216</string>
			</dict>
			<key>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</key>
			<dict>
				<key>git_hash</key>
				<string>b8f284e6c75df3a3b1084900b6144afc9572136a</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/IntuneUploader/IntuneAppUploader.py</string>
				<key>sha256_hash</key>
				<string>a3c6f2b00735af1c475b1faca1fab9091020956ae4219e640907645740b80263</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.almenscorner.intune.FirefoxSigned</key>
			<dict>
				<key>git_hash</key>
				<string>bb54f0e9ec08a805b04d7a0bacb71abbdccc2505</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/Mozilla/FirefoxSigned.intune.recipe</string>
				<key>sha256_hash</key>
				<string>2ebde58a0c249825fb96942386c2f9a63ae21fec15aaf1808e0731a81576efe6</string>
			</dict>
			<key>com.github.autopkg.download.FirefoxSignedPkg</key>
			<dict>
				<key>git_hash</key>
				<string>b8ebd97b7fc92cc4a9dc382ccc2ff8090c1b8f21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/FirefoxSignedPkg.download.recipe</string>
				<key>sha256_hash</key>
				<string>63a854b014f941e7c6a24714eab91310ca0d40b91ab33e609724f24e918be53f</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
